<?
	function t1 ($a){
	echo "Задание 1".'<br>';
	echo $a * $a.'<br>';}
	t1(5);
	//----------------------

	function t2 ($b, $c){
	echo "Задание 2".'<br>';
	echo $b + $c.'<br>';}
	t2(3, 6);
	//----------------------

	function t3 ($d, $e, $f){
	echo "Задание 3".'<br>';
	echo ($d-$e)/$f.'<br>';}
	t3(5, 1, 2);
	//----------------------


	function t4 ($g){$arr=
	[
		1=>"Понедельник",
		2=>"Вторник",
		3=>"Среда",
		4=>"Четверг",
		5=>"Пятница",
		6=>"Суббота",
		7=>"Воскресенье"
	];
	echo "Задание 4".'<br>';
	echo $arr[$g];}
	t4(5);